{
  "_name_or_path": "xlm-roberta-large",
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-ADAGE",
    "2": "I-ADAGE",
    "3": "B-ART",
    "4": "I-ART",
    "5": "B-CARDINAL",
    "6": "I-CARDINAL",
    "7": "B-CONTACT",
    "8": "I-CONTACT",
    "9": "B-DATE",
    "10": "I-DATE",
    "11": "B-DISEASE",
    "12": "I-DISEASE",
    "13": "B-EVENT",
    "14": "I-EVENT",
    "15": "B-FACILITY",
    "16": "I-FACILITY",
    "17": "B-GPE",
    "18": "I-GPE",
    "19": "B-LANGUAGE",
    "20": "I-LANGUAGE",
    "21": "B-LAW",
    "22": "I-LAW",
    "23": "B-LOCATION",
    "24": "I-LOCATION",
    "25": "B-MISCELLANEOUS",
    "26": "I-MISCELLANEOUS",
    "27": "B-MONEY",
    "28": "I-MONEY",
    "29": "B-NON_HUMAN",
    "30": "I-NON_HUMAN",
    "31": "B-NORP",
    "32": "I-NORP",
    "33": "B-ORDINAL",
    "34": "I-ORDINAL",
    "35": "B-ORGANISATION",
    "36": "I-ORGANISATION",
    "37": "B-PERSON",
    "38": "I-PERSON",
    "39": "B-PERCENTAGE",
    "40": "I-PERCENTAGE",
    "41": "B-POSITION",
    "42": "I-POSITION",
    "43": "B-PRODUCT",
    "44": "I-PRODUCT",
    "45": "B-PROJECT",
    "46": "I-PROJECT",
    "47": "B-QUANTITY",
    "48": "I-QUANTITY",
    "49": "B-TIME",
    "50": "I-TIME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "O": 0,
    "B-ADAGE": 1,
    "I-DATE": 10,
    "B-DISEASE": 11,
    "I-DISEASE": 12,
    "B-EVENT": 13,
    "I-EVENT": 14,
    "B-FACILITY": 15,
    "I-FACILITY": 16,
    "B-GPE": 17,
    "I-GPE": 18,
    "B-LANGUAGE": 19,
    "I-ADAGE": 2,
    "I-LANGUAGE": 20,
    "B-LAW": 21,
    "I-LAW": 22,
    "B-LOCATION": 23,
    "I-LOCATION": 24,
    "B-MISCELLANEOUS": 25,
    "I-MISCELLANEOUS": 26,
    "B-MONEY": 27,
    "I-MONEY": 28,
    "B-NON_HUMAN": 29,
    "B-ART": 3,
    "I-NON_HUMAN": 30,
    "B-NORP": 31,
    "I-NORP": 32,
    "B-ORDINAL": 33,
    "I-ORDINAL": 34,
    "B-ORGANISATION": 35,
    "I-ORGANISATION": 36,
    "B-PERSON": 37,
    "I-PERSON": 38,
    "B-PERCENTAGE": 39,
    "I-ART": 4,
    "I-PERCENTAGE": 40,
    "B-POSITION": 41,
    "I-POSITION": 42,
    "B-PRODUCT": 43,
    "I-PRODUCT": 44,
    "B-PROJECT": 45,
    "I-PROJECT": 46,
    "B-QUANTITY": 47,
    "I-QUANTITY": 48,
    "B-TIME": 49,
    "B-CARDINAL": 5,
    "I-TIME": 50,
    "I-CARDINAL": 6,
    "B-CONTACT": 7,
    "I-CONTACT": 8,
    "B-DATE": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
